graph main_graph (
  %input.1[FLOAT, 1x256x61x1], exponents: [0]
) initializers (
  %conv4.weight[FLOAT, 3x3x64x64]
  %conv4.bias[FLOAT, 64]
  %conv2.weight[FLOAT, 3x3x16x32]
  %conv1.weight[FLOAT, 3x3x1x16]
  %conv2.bias[FLOAT, 32]
  %final_layer.weight[INT8, 1x1x64x2]
  %/Constant_output_0[INT64, 2]
  %final_layer.bias[INT32, 2]
  %conv3.weight[FLOAT, 3x3x32x64]
  %conv1.bias[FLOAT, 16]
  %conv3.bias[FLOAT, 64]
) {
  %/conv/relu/Relu_output_0 = Conv[activation = 'Relu', dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [0, 0, 0, 0], quant_type = 'S8', strides = [1, 1]](%input.1, %conv1.weight, %conv1.bias)
  %/conv/relu_1/Relu_output_0 = Conv[activation = 'Relu', dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [0, 0, 0, 0], quant_type = 'S8', strides = [1, 1]](%/conv/relu/Relu_output_0, %conv2.weight, %conv2.bias)
  %/conv/pool/MaxPool_output_0 = MaxPool[ceil_mode = 0, dilations = [1, 1], kernel_shape = [2, 2], pads = [0, 0, 0, 0], quant_type = 'S8', strides = [2, 2]](%/conv/relu_1/Relu_output_0)
  %/conv/relu_2/Relu_output_0 = Conv[activation = 'Relu', dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [0, 0, 0, 0], quant_type = 'S8', strides = [1, 1]](%/conv/pool/MaxPool_output_0, %conv3.weight, %conv3.bias)
  %/conv/relu_3/Relu_output_0 = Conv[activation = 'Relu', dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [0, 0, 0, 0], quant_type = 'S8', strides = [1, 1]](%/conv/relu_2/Relu_output_0, %conv4.weight, %conv4.bias)
  %/conv/pool_1/MaxPool_output_0 = MaxPool[ceil_mode = 0, dilations = [1, 1], kernel_shape = [2, 2], pads = [0, 0, 0, 0], quant_type = 'S8', strides = [2, 2]](%/conv/relu_3/Relu_output_0)
  %/global_avg_pool/GlobalAveragePool_output_0 = GlobalAveragePool[quant_type = 'S8'](%/conv/pool_1/MaxPool_output_0)
  %PPQ_Variable_0 = Transpose[perm = [0, 3, 1, 2], quant_type = 'S8'](%/global_avg_pool/GlobalAveragePool_output_0)
  %/Reshape_output_0 = Reshape[quant_type = 'S8'](%PPQ_Variable_0, %/Constant_output_0)
  %30 = Gemm[activation = 'Linear', alpha = 1, beta = 1, quant_type = 'S8', transB = 0](%/Reshape_output_0, %final_layer.weight, %final_layer.bias)
  return %30
}


initializers value:
%conv4.weight, shape: [3, 3, 64, 64], exponents: [-9], docString: layout ==> N16HWC16, 
value: array([-2.29212232e-02, -2.78439783e-02,  9.89897363e-03,  1.92018524e-02,
        1.65444857e-03,  1.81801580e-02, -8.70530726e-04,  4.00372036e-02,
        1.51805878e-02, -9.02777631e-03, -1.17693692e-02,  9.70399007e-03,
       -3.29813361e-02,  1.19194537e-02, -1.92854293e-02, -9.08649806e-03,
       -1.58827566e-02,  1.02922320e-02,  8.00319295e-03,  6.10113367e-02,
        3.55687626e-02,  1.06954416e-02, -4.82081212e-02, -4.49102409e-02,
       -4.05538045e-02, -5.28509775e-03, -3.80937420e-02, -4.32881573e-03,
       -2.26627123e-02, -1.87341776e-02, -1.08133834e-02,  8.38392973e-03,
       -1.35138417e-02, -4.66939174e-02, -2.21223738e-02, -3.56214377e-03,
       -2.90715415e-02, -1.66547876e-02,  4.98019019e-03,  1.30671337e-02,
       -1.60670083e-03,  1.79070123e-02,  2.70662811e-02,  3.26854289e-02,
        2.31528301e-02, -2.75606494e-02,  2.05137636e-04, -5.50240837e-02,
       -2.26532649e-02, -4.26430739e-02, -3.81348131e-04,  2.93926317e-02,
        1.60401426e-02, -1.63813327e-02,  7.56797707e-03, -3.20154317e-02,
       -2.81267520e-02, -4.61823158e-02,  1.02712726e-02, -2.52008680e-02,
       -3.33923958e-02, -1.89958867e-02, -1.69006139e-02, -9.65295080e-03,
       -1.66843738e-02,  1.27496980e-02, -2.76546404e-02,  3.66275548e-03,
        1.25282286e-02,  7.64321955e-03,  3.44588608e-02,  2.02776566e-02,
       -2.06779297e-02, -3.35182250e-02, -3.37298326e-02, -3.02331597e-02,
       -1.29065709e-02, -1.20348074e-02, -2.96087358e-02, -3.91102256e-03,
        1.55211417e-02,  5.11487341e-03, -2.45585106e-02,  2.56977580e-03,
        3.58420461e-02, -5.67210540e-02, -7.89382905e-02, -7.13532344e-02,
        2.63266335e-03, -3.92694063e-02, -9.94047895e-03, -2.02827659e-02,
       -3.03902775e-02, -4.86289375e-02,  4.08262499e-02,  7.41294026e-03,
        6.52959943e-03, -8.94297194e-03, -1.90810058e-02,  2.41836775e-02,
       -1.04938447e-02, -2.15846132e-02, -3.39406729e-02, -3.17674987e-02,
        2.28888541e-02, -6.98598474e-03,  4.00156714e-02,  1.64274462e-02,
       -2.01915298e-02, -4.11580782e-03,  1.91663764e-02,  2.95645911e-02,
       -5.39648421e-02, -5.08817397e-02, -3.38072143e-02, -4.45821555e-03,
       -3.11177783e-02,  1.37161752e-02,  2.47348705e-03,  2.67530493e-02,
       -7.16870418e-03,  1.01273153e-02, -4.70908284e-02,  1.61394477e-02,
       -2.26798449e-02,  5.86173944e-02,  1.36065139e-02, -5.20894751e-02,
       -5.19257002e-02, -2.54123416e-02,  1.05169881e-02,  1.20796049e-02,
       -2.48072669e-02,  6.48469627e-02,  5.28285354e-02,  5.74252568e-02,
       -3.97078097e-02, -3.61109711e-02,  2.43135393e-02, -1.37448814e-02,
       -2.02234872e-02,  7.44517380e-03, -3.41198929e-02,  7.13384617e-03,
        2.98874881e-02,  6.77841855e-03,  1.85559727e-02, -2.45493855e-02,
        1.40410131e-02,  2.67299358e-02,  1.69484504e-02,  2.29420178e-02,
       -3.54442671e-02, -2.32202802e-02, -2.50544545e-04, -3.49046034e-03,
        9.49842331e-04, -2.95182671e-02, -1.33264801e-02,  2.98202690e-02,
        4.61387634e-03,  8.35851729e-02,  6.69007227e-02,  7.93787837e-02,
       -4.20606285e-02,  9.08083189e-03, -1.13071585e-02,  2.75678374e-02,
       -7.31933117e-02,  5.14966622e-02, -9.21688508e-03, -4.91239280e-02,
        2.98620723e-02,  1.36588775e-02, -1.38633791e-02,  1.47693027e-02,
       -2.73354482e-02,  4.70726984e-03, -8.06424709e-04, -2.04596240e-02,
       -1.37597211e-02, -3.90274189e-02,  2.97364686e-03, -1.43616379e-03,
       -7.25571532e-03, -1.36639578e-02, -2.21843068e-02,  3.59313749e-02,
       -1.40341753e-02,  2.15323549e-02,  3.95891741e-02, -2.35594008e-02,
       -4.11977023e-02, -8.52037780e-03,  3.73088792e-02,  3.37947644e-02,
       -2.69126631e-02,  4.35612388e-02,  3.32372375e-02, -3.26540284e-02,
       -3.13142762e-02, -2.34399661e-02, -1.85369160e-02,  1.94613747e-02,
       -5.89182088e-03,  4.41779308e-02,  2.94759944e-02, -2.46912669e-02,
        4.23389338e-02,  4.59866375e-02, -2.40575522e-02,  1.83663741e-02,
        2.65744757e-02, -1.78812843e-04, -1.47530099e-03, -4.10614489e-03,
        1.11539830e-02,  2.91994810e-02, -3.25199291e-02, -3.60638984e-02,
        2.99747307e-02,  2.12291703e-02, -3.91454250e-02,  2.19513439e-02,
        6.70221355e-03,  2.39966791e-02, -2.72717886e-02, -2.55645365e-02,
       -2.04777308e-02,  2.38858890e-02,  2.93177329e-02, -4.73868325e-02,
       -3.50189470e-02, -3.53170075e-02, -3.43498550e-02, -6.63692690e-03,
       -8.42916220e-03,  1.68439392e-02,  2.07227077e-02,  7.03761633e-03,
        4.25944515e-02, -1.66258514e-02,  2.75817234e-02,  2.08524987e-02,
       -1.98325552e-02,  1.10517340e-02, -6.47433698e-02,  1.96015090e-02,
       -4.46402915e-02, -2.58328784e-02, -1.76010877e-02,  4.64913901e-03,
       -1.82182845e-02, -1.62805729e-02,  3.20636630e-02,  3.18226255e-02,
       -2.09196769e-02, -4.05864790e-02, -6.37424588e-02, -2.81592384e-02,
        2.39218045e-02, -2.35878322e-02, -2.71233115e-02, -2.34560501e-02,
        5.92129887e-04, -3.41725280e-03,  3.67650650e-02,  3.53634506e-02,
       -6.15365170e-02, -1.93569213e-02, -2.01755315e-02, -3.29612307e-02,
        1.41829401e-02, -6.30544825e-03,  9.27265827e-03, -3.46426736e-03,
       -2.09479351e-02, -2.10248865e-02,  2.06452534e-02,  1.81624331e-02,
       -3.71043570e-02,  1.77327376e-02, -1.77665576e-02, -2.12932732e-02,
        7.31840823e-03, -3.13784368e-02, -1.64306592e-02,  7.34852208e-03,
        3.37333791e-02,  1.20339766e-02, -3.93120050e-02, -2.50491523e-03,
       -2.64784805e-02, -1.56868100e-02,  9.73310228e-03, -2.45215390e-02,
        1.96210723e-02,  2.19817627e-02, -7.27622630e-03,  3.01608220e-02,
       -6.68179756e-03, -1.64562371e-02,  1.27392095e-02,  1.88293378e-03,
        6.78121287e-04,  2.59383209e-02, -2.87283715e-02, -1.29785920e-02,
       -5.92583511e-03,  1.45172083e-03,  1.50156580e-02, -1.73959620e-02,
       -7.22641079e-03,  3.55169326e-02,  2.99663506e-02,  1.15138153e-02,
        3.01428381e-02, -2.07319446e-02,  1.59043875e-02, -3.56060676e-02,
       -4.18270715e-02, -2.18115747e-02,  7.67728221e-03,  1.92337018e-02,
       -2.04327833e-02,  2.04287004e-02, -3.35686356e-02, -1.02424379e-02,
        1.78593434e-02,  3.21251573e-03,  3.50647233e-02,  1.87095627e-02,
        4.22759168e-03, -4.80120815e-03, -3.01050022e-02, -3.44766490e-02,
       -2.28140987e-02,  7.03265518e-03,  2.45209169e-02, -3.56305279e-02,
        7.76324305e-04,  1.85864698e-02,  4.31788675e-02,  4.63456661e-03,
       -1.21674277e-02, -4.48525809e-02, -1.55272698e-02, -1.45949246e-02,
       -1.60939973e-02,  4.11247015e-02, -2.49336995e-02,  7.90667906e-03,
       -1.67440213e-02,  1.27775595e-02, -1.17534650e-02, -3.96406427e-02,
       -3.93174849e-02,  2.81555951e-03, -3.33761834e-02, -2.18016692e-02,
        2.91734766e-02, -2.02164706e-02,  3.05842310e-02,  1.36095528e-02,
        2.63756700e-02,  1.82265192e-02, -1.98836196e-02,  2.06228700e-02,
       -1.59865548e-03,  4.18091118e-02, -2.45404337e-02,  1.09653929e-02,
       -4.50457521e-02,  1.39554571e-02, -3.04370858e-02, -3.01352032e-02,
        2.84343138e-02, -2.35258695e-02, -3.73044387e-02,  3.14485580e-02,
        2.08415426e-02, -5.09560993e-03, -1.29423675e-03, -3.42180580e-03,
       -1.32465865e-02, -1.61962509e-02, -6.27965806e-03, -3.85328420e-02,
        3.98439243e-02, -8.15093145e-03, -7.73778302e-04, -1.34556191e-02,
       -2.73229554e-02,  3.13338861e-02,  6.71445578e-03,  1.70565248e-02,
       -2.04213597e-02,  2.77348645e-02,  2.31569745e-02,  1.75412523e-03,
        4.28389832e-02,  9.70943831e-03, -4.47574444e-03, -3.58607657e-02,
        1.10706380e-02,  3.92538775e-03,  1.91222243e-02, -3.58350612e-02,
        2.10687593e-02, -4.53987271e-02, -6.61983108e-03, -2.28357166e-02,
       -1.37475617e-02,  1.37961302e-02,  1.03075653e-02,  3.14487107e-02,
       -2.24248823e-02, -3.57645899e-02, -4.64315899e-02, -3.07352729e-02,
       -3.56375389e-02,  4.02146652e-02,  5.45893200e-02,  3.94881032e-02,
        1.54506359e-02,  5.45259053e-03, -2.87067126e-02, -1.10218637e-02,
       -3.32683288e-02,  2.08804924e-02,  2.39015706e-02, -4.93078446e-03,
       -5.49931428e-04,  2.51446608e-02,  1.34689612e-02,  3.70969623e-03,
       -2.90800594e-02,  1.92951187e-02, -3.33050080e-02,  6.03141310e-03,
        1.44958310e-02, -2.04456728e-02, -1.04949130e-02, -2.01608166e-02,
        2.06563026e-02,  1.15559287e-02,  5.57718100e-03, -2.14697421e-02,
        2.94919759e-02,  3.97953838e-02, -1.03131440e-02,  3.89206898e-03,
       -2.28864234e-02,  2.82993671e-02,  1.71688572e-02,  3.85641470e-03,
       -4.12436984e-02,  1.26475105e-02,  8.04338511e-03, -1.20270960e-02,
        1.64143567e-03, -3.74047458e-02,  3.07449661e-02,  3.79047170e-02,
        3.33335474e-02,  5.15195914e-02,  5.59908971e-02,  3.14461552e-02,
        4.43943031e-03, -7.02016652e-02, -9.86988693e-02, -6.89041987e-02,
       -1.38295479e-02,  4.99414466e-02, -2.69108042e-02, -2.13074610e-02,
        5.91211244e-02, -9.78410766e-02, -3.35074589e-02,  5.63076213e-02,
       -3.07766609e-02,  2.58548069e-03,  3.24345636e-03, -3.90888005e-02,
       -6.13436801e-03,  2.66739130e-02, -2.40213666e-02,  5.30723780e-02,
       -4.43858653e-02,  2.81879324e-02,  3.03126797e-02,  1.54693648e-02,
       -3.61402370e-02,  2.76396815e-02, -5.58391307e-03,  9.71043203e-03,
       -3.97579744e-02,  8.97836592e-03,  1.07043656e-02, -3.44604207e-03,
        6.30981103e-03, -1.88253429e-02, -3.23517434e-02, -2.70777121e-02,
       -3.52796279e-02, -3.77567066e-03,  3.01877074e-02, -5.10352664e-03,
       -3.24662775e-02,  1.98015347e-02,  2.67743170e-02,  2.18668710e-02,
       -2.26184055e-02,  3.68605591e-02,  3.49911512e-04, -3.88591476e-02,
        3.46160606e-02, -3.57596800e-02, -1.87133998e-02, -3.26094888e-02,
        1.86305512e-02, -1.47049688e-02, -3.24598290e-02, -2.80240383e-02,
       -4.01729941e-02,  3.16940248e-02, -3.49755324e-02, -2.09752433e-02,
       -3.99872055e-03, -2.03534551e-02,  1.06305198e-03, -3.58771416e-03,
       -1.55569669e-02,  2.95176748e-02,  2.55615916e-02,  2.42222548e-02,
        2.08382048e-02, -9.47972201e-03,  1.39248176e-02,  3.45741436e-02,
       -3.83812338e-02,  5.29815890e-02,  1.07513759e-02, -2.11914312e-02,
       -2.02433411e-02,  1.82455294e-02, -6.57619210e-03, -4.21757400e-02,
       -2.57281940e-02,  1.02394857e-02, -2.15825196e-02, -3.92086431e-02,
       -4.55458499e-02,  8.98607913e-03, -2.58413684e-02, -7.16149982e-04,
       -1.49264885e-02, -2.39280444e-02,  2.42792387e-02,  3.52324657e-02,
        3.46112549e-02,  4.15296443e-02, -2.10493933e-02,  7.90069718e-03,
        2.60338057e-02, -2.53739599e-02,  4.71771844e-02,  4.06236872e-02,
       -4.62735072e-02, -1.60441790e-02,  2.42583323e-02,  2.54601408e-02,
        1.97697468e-02,  4.16736901e-02,  6.01010630e-03, -1.18992375e-02,
        2.09513400e-02,  3.95049751e-02,  1.26455827e-02, -1.99885275e-02,
       -2.22883783e-02,  1.92654263e-02,  1.45989712e-02,  1.41330883e-02,
        1.32283010e-02, -2.17803791e-02, -1.14409383e-02,  7.09799584e-03,
       -1.07631041e-02, -6.11466020e-02, -2.24286355e-02,  1.36787975e-02,
       -2.62642968e-02,  3.55468169e-02,  4.78249555e-03,  2.55505256e-02,
       -2.66244840e-02, -5.08559607e-02, -1.95377339e-02, -4.41845395e-02,
        2.61469949e-02,  2.35761814e-02,  1.90983824e-02, -2.16779690e-02,
       -2.17693839e-02,  2.15934105e-02, -6.14566309e-03,  3.50387301e-03,
       -3.30530293e-02, -6.26941118e-03,  1.49474740e-02, -1.29237212e-02,
        9.08279140e-03, -1.33479841e-03,  2.98580970e-03, -8.77289847e-03,
       -1.43073769e-02, -1.41631914e-02,  1.31116379e-02, -3.83239575e-02,
       -3.33755240e-02,  3.37246656e-02,  3.72893480e-03,  1.42517164e-02,
       -3.02321129e-02, -3.12906727e-02, -3.45173059e-03, -3.61456051e-02,
       -3.07627302e-02,  5.49122132e-02,  2.06921380e-02,  4.37081419e-03,
        7.28131784e-03, -4.67067622e-02, -3.84467281e-02, -1.65475700e-02,
        1.15593579e-02,  2.91205775e-02,  2.29906496e-02,  1.18598221e-02,
        1.44344317e-02,  2.22185142e-02,  1.12530431e-02,  2.83496194e-02,
        3.55570228e-03, -1.74974799e-02, -1.68071780e-02, -3.60769033e-02,
       -4.12161537e-02,  3.07056569e-02, -6.90782024e-03,  5.92856947e-03,
       -2.86027696e-02, -2.46597035e-03, -1.41251246e-02,  1.40757998e-02,
       -3.75223383e-02, -3.11410073e-02,  1.62094515e-02,  2.77837683e-02,
        2.81900186e-02, -3.52734849e-02, -1.56113617e-02, -2.48954799e-02,
       -9.85217839e-03,  2.60606445e-02, -1.51970461e-02, -2.03455258e-02,
       -2.93764826e-02,  1.35527235e-02,  1.20347254e-02,  2.48942934e-02,
       -2.59569148e-04, -4.22770791e-02, -2.55880635e-02,  2.44721235e-03,
       -3.45776044e-02,  1.26375714e-02,  1.06651392e-02,  5.75881340e-02,
       -9.23491176e-03, -3.15204449e-02, -1.33266542e-02, -1.97868124e-02,
        3.13974395e-02, -9.81983077e-03, -3.71707194e-02,  1.14088003e-02,
       -5.84640075e-03, -3.94219952e-03, -7.08482985e-04, -1.94766239e-04,
        9.25612357e-03, -8.91217869e-03,  1.62056312e-02, -3.01008169e-02,
        1.91014761e-03, -2.97612045e-02,  4.14401200e-03, -1.81009565e-02,
        1.13453660e-02, -1.01595838e-02,  2.51384806e-02, -3.17562744e-02,
       -2.08124910e-02,  9.47781280e-03,  1.05185844e-02, -1.04230354e-02,
        2.54748426e-02, -2.11617388e-02, -9.58999060e-03, -1.40069413e-03,
       -8.04792531e-03, -2.36467458e-02, -3.29204090e-02,  3.78063740e-03,
        2.16658674e-02,  2.24119052e-02,  2.56011225e-02, -3.15993056e-02,
       -8.81624222e-03, -5.58013991e-02, -5.22598587e-02, -1.10182269e-02,
       -2.77410690e-02,  3.74121144e-02,  5.95123172e-02,  5.58284298e-02,
        2.25562491e-02, -6.08570427e-02,  1.83171481e-02,  1.96221918e-02,
        1.95571426e-02, -2.09701173e-02, -1.81173161e-02, -4.89389002e-02,
       -3.44048403e-02,  3.20015959e-02, -1.77434739e-02, -1.99477803e-02,
       -4.84559825e-03,  4.21722718e-02,  2.31840252e-03, -2.03902293e-02,
       -1.20063769e-02,  9.13686643e-04, -1.73508171e-02,  3.75727564e-02,
       -3.70088569e-03, -8.44679214e-03,  2.96049900e-02, -1.34659661e-02,
       -5.09600863e-02, -8.97108298e-03, -5.36262318e-02, -4.58755307e-02,
        6.46033371e-03,  4.07697521e-02,  4.38335314e-02,  6.62988471e-03,
        1.62769202e-02,  1.93594154e-02, -1.48143293e-02, -2.70954408e-02,
        2.39998568e-02, -6.37189019e-03,  2.65684500e-02, -1.95753686e-02,
        2.36939285e-02, -9.97261814e-05, -5.08348234e-02, -4.69102338e-02,
       -2.00141128e-02,  2.17124913e-02,  7.60551263e-03,  1.56175978e-02,
        3.31644155e-02, -4.64893058e-02, -1.08373435e-02, -2.06809994e-02,
       -5.36241829e-02, -3.07348594e-02,  1.53714996e-02, -4.05649394e-02,
        1.47982845e-02, -2.98792180e-02, -3.14086825e-02,  3.34217623e-02,
       -1.13797188e-02, -2.78388206e-02,  2.58925445e-02,  6.70876447e-03,
       -2.88271867e-02, -3.67517136e-02,  3.23863402e-02,  2.09675692e-02,
       -7.53907813e-03, -2.61632521e-02,  3.65113989e-02,  8.58749636e-03,
        1.85868256e-02, -2.08954439e-02, -2.04839297e-02, -3.35748196e-02,
       -1.95675697e-02,  6.19373843e-03, -9.32492549e-04,  4.89989761e-03,
       -1.44839585e-02,  3.69581282e-02, -2.88482755e-02, -9.30967368e-03,
        2.95813791e-02, -7.23934500e-03, -3.81156392e-02, -7.72013376e-03,
        2.45479867e-02, -3.29962969e-02,  4.20444505e-03, -1.42806843e-02,
        2.33107414e-02,  4.92655933e-02,  1.93293430e-02, -8.78097082e-04,
       -2.72004548e-02,  2.85679288e-02, -3.62134762e-02, -2.39123739e-02,
        3.53441737e-03,  2.92883366e-02, -5.28016128e-03,  1.17670838e-02,
       -3.99264768e-02, -2.56062578e-02, -3.89274657e-02, -3.60985436e-02,
        1.53154796e-02, -9.70698707e-03, -3.35728861e-02,  3.69409695e-02,
       -1.09536853e-02, -1.27235036e-02, -7.51372101e-03,  3.80944274e-02,
        1.30184172e-02, -1.96775392e-04,  2.99481805e-02, -1.64751278e-03,
        2.07664911e-02,  3.92745286e-02, -7.08247954e-03, -4.42396216e-02,
        2.80443747e-02,  3.95052508e-02,  1.56841278e-02,  1.77410338e-02,
       -2.06993502e-02,  2.70454567e-02,  2.10567657e-02, -3.60108889e-03,
        2.88833715e-02,  5.21883816e-02,  4.02434953e-02,  2.03032549e-02,
       -1.68243796e-02, -5.53715974e-02, -1.14522511e-02, -2.79235821e-02,
        1.04254596e-02,  1.10474518e-02,  5.79572096e-02,  3.02184373e-02,
       -8.59093945e-03,  1.71528868e-02, -3.63746732e-02, -3.64408232e-02,
        1.31836245e-02,  1.26536414e-02, -5.08661270e-02, -2.40973011e-03,
        1.45321311e-02,  1.05806869e-02,  2.16797926e-02, -1.58263706e-02,
       -2.03995556e-02,  4.96273190e-02,  4.65088189e-02, -1.72204077e-02,
        1.96781121e-02, -6.04805211e-03,  2.55308878e-02, -1.72507577e-02,
       -1.18863285e-02,  6.25455379e-02, -4.44084816e-02, -1.03678927e-02,
        4.22759727e-03, -2.71602310e-02, -2.56892815e-02, -3.69598009e-02,
        3.62152904e-02,  2.02835873e-02, -3.10384505e-03,  3.35870869e-03,
        3.88243012e-02, -1.52989086e-02, -3.46946605e-02,  2.94392067e-03,
       -2.77565699e-02, -1.32306479e-02,  2.30934322e-02,  2.23486125e-02,
        1.08980453e-02,  3.41816135e-02,  3.17401811e-02,  1.92664135e-02,
        9.55181755e-03,  6.75774179e-03, -1.31034860e-02,  2.14799005e-03,
       -3.40163000e-02, -1.40933180e-02, -2.27151718e-02,  1.71379894e-02,
        2.09089983e-02, -4.79071774e-03,  2.83780675e-02,  2.55563390e-02,
        8.52019060e-03, -1.22308368e-02,  1.79029237e-02,  1.44374100e-02,
        3.45755406e-02, -1.75314564e-02, -2.99642272e-02,  5.48082450e-03,
       -1.99904107e-02, -1.87967215e-02,  3.35347429e-02,  3.29898596e-02,
       -2.82084104e-02, -1.07641499e-02, -6.41278515e-04,  2.45188586e-02,
       -3.81721444e-02,  1.32178571e-02, -2.79535819e-02,  2.67576315e-02,
        2.57787090e-02,  4.67036627e-02,  1.76143687e-04,  5.35486974e-02,
        6.02106471e-03,  1.31757166e-02, -1.46182561e-02, -4.16388325e-02,
       -4.17301571e-03, -2.10743193e-02, -4.94005252e-03, -8.90302123e-04,
        7.38437176e-02,  3.70528027e-02,  7.74888545e-02,  9.06653032e-02,
        2.92107370e-03, -4.46550436e-02, -9.59923118e-02, -1.12455688e-01,
       -2.39086039e-02,  5.57956658e-02, -1.55946268e-02,  3.57238315e-02,
        2.49094199e-02, -6.16903342e-02,  2.55652014e-02,  7.33388737e-02,
       -2.04567946e-02, -1.36120394e-02, -1.81800649e-02, -7.51956599e-03,
        2.39472892e-02, -3.15127112e-02,  2.06507891e-02,  1.99022237e-02,
       -2.54542455e-02, -2.98408214e-02,  1.21037522e-02, -1.68490447e-02,
       -1.99391246e-02,  2.22461615e-02, -3.72785516e-02, -1.20260995e-02,
        6.55617565e-02,  2.52875239e-02, -3.56198684e-03,  5.45759574e-02,
        2.10944917e-02,  1.89749505e-02, -5.18227033e-02,  3.81104043e-03,
       -3.03793550e-02, -1.59033835e-02,  2.20416649e-03, -5.52443881e-03,
       -6.86142454e-03, -6.17615180e-03,  5.18965833e-02,  4.80883755e-02,
        2.21466422e-02,  3.12509984e-02,  1.16844792e-02, -3.76587026e-02,
        1.01201814e-02,  3.87625885e-03,  4.16550636e-02,  2.29369458e-02,
        1.04135470e-02, -2.21229065e-02, -1.50682153e-02, -3.54775437e-03,
       -1.53934741e-02,  6.50725560e-03, -3.61222439e-02, -8.75395816e-03,
       -1.35816326e-02, -1.82281565e-02, -1.22987796e-02, -4.95228097e-02,
       -3.59971523e-02,  1.00826554e-03,  4.94325981e-02,  8.81184544e-03,
       -5.74598601e-03,  2.64133010e-02, -3.37653682e-02,  2.27464736e-02,
       -2.81412080e-02,  1.53562445e-02,  9.01221856e-03, -2.68543791e-02,
       -1.44599276e-02,  7.62859546e-03,  4.85936143e-02,  1.23027749e-02,
        1.76267978e-02, -4.00106795e-02, -4.55574133e-02, -1.13786552e-02,
       -3.32178809e-02,  1.60385743e-02, -5.19107357e-02, -1.90191641e-02,
       -3.17899557e-03, -4.51386385e-02, -2.63590198e-02,  2.31431127e-02,
       -6.84743971e-02,  3.90586746e-03, -1.93481985e-02, -2.92456355e-02,
        6.26736181e-03, -2.37456467e-02,  8.31411220e-03, -2.46412940e-02,
        8.03271867e-03,  6.27286173e-03, -1.08984392e-02,  1.16164703e-02,
       -5.12021929e-02, -1.94171555e-02, -2.38969792e-02, -1.06102815e-02,
        2.25840732e-02, -5.00809960e-03, -2.20590662e-02,  8.88856687e-03,
        1.86534785e-02,  4.41044429e-03,  1.09154284e-02,  1.84991769e-02,
        1.52997132e-02,  3.35901231e-02, -1.53952027e-02, -1.05410572e-02,
        2.51365057e-03,  7.34880450e-04, -4.01357710e-02, -2.71056127e-02,
       -2.51798984e-02,  3.48206311e-02,  2.15902757e-02,  4.72123772e-02,
       -3.43913734e-02,  1.19703067e-02,  4.15604040e-02,  3.14367637e-02,
        3.16804349e-02,  2.60940790e-02,  1.21702971e-02, -4.41535609e-03,
        2.49483399e-02,  7.15675438e-03,  1.81507692e-02, -1.76421851e-02,
        4.46734838e-02, -4.70272405e-03,  1.14516346e-02, -3.04031055e-02,
        3.41091193e-02, -2.63215788e-02, -1.57454498e-02, -4.60318960e-02,
        1.67602133e-02, -2.94582243e-03, -1.44008975e-02, -2.20304485e-02,
        3.07353009e-02, -9.14232526e-03, -2.54103821e-02,  1.89675018e-02,
        2.95292363e-02,  1.78575702e-02, -4.36785631e-03,  6.74765185e-03,
       -4.56470065e-03,  2.88736466e-02,  2.74358713e-03, -1.26064755e-02,
       -3.40792090e-02,  1.78749431e-02,  2.20241211e-02, -2.61154640e-02,
       -3.41603230e-03,  7.49418885e-03,  4.96810153e-02, -4.33473773e-02,
       -6.10575303e-02, -1.00162961e-02, -3.71270739e-02, -4.84904367e-03,
        2.38299370e-02,  4.40799370e-02,  5.26770018e-02,  4.19014022e-02,
       -5.09235710e-02, -5.69946617e-02,  1.64370500e-02, -3.69376168e-02,
       -6.85271174e-02,  1.41858011e-02, -2.03535203e-02,  2.17343811e-02,
       -3.94606143e-02, -3.68161127e-02,  1.76017284e-02, -4.28468138e-02,
       -2.53639556e-02,  5.77871548e-03,  1.59150939e-02,  5.69131561e-02,
        7.65439775e-03,  2.21437570e-02,  1.63043048e-02,  1.69369299e-02,
        1.27155019e-03,  3.31975147e-02, -1.64305344e-02, -4.01860327e-02,
       -3.02394312e-02,  2.97496631e-03,  3.58577631e-02, -3.09692640e-02,
       -4.35053632e-02,  3.59868407e-02,  1.93412451e-03, -2.18537822e-02,
       -2.38465015e-02, -3.88219841e-02,  2.18051635e-02, -7.47267436e-03,
       -2.96138469e-02,  1.16412826e-02, -1.73089672e-02, -5.34982304e-04,
        9.65406001e-03,  7.47224465e-02,  1.19224954e-02,  4.61430810e-02,
       -3.98360984e-03,  6.45219395e-03, -1.31406104e-02, -6.30936176e-02,
       -5.45114242e-02,  9.68164857e-03, -1.91570539e-02, -2.92034745e-02,
        2.76874490e-02, -2.80033927e-02, -3.08247283e-03,  6.35873005e-02,
       -1.30415903e-02,  3.17140259e-02,  1.92874614e-02, -2.46819332e-02,
       -3.83873433e-02,  3.94323133e-02, -3.86960059e-02, -3.45981843e-03,
       -3.83806005e-02,  3.81850339e-02, -9.31049231e-03, -7.78294867e-03,
       -9.47006885e-03, -2.09540147e-02, -2.10299026e-02, -2.10038982e-02,
        2.00951677e-02, -4.73144930e-03, -2.31456123e-02, -2.97006257e-02,
       -1.00552579e-02,  3.16784754e-02,  1.95517074e-02, -1.70131717e-02,
       -5.47451992e-03,  9.99232102e-03,  7.42570171e-03, -6.59557665e-03,
       -4.03988808e-02, -2.77394392e-02,  2.05683075e-02, -1.37951635e-02,
       -2.40134224e-02,  3.98900583e-02,  4.42653522e-02, -2.08611344e-03,
       -1.02145408e-04, -1.31477732e-02,  3.15867625e-02,  5.79855405e-03,
        3.35106142e-02,  4.56077047e-02, -1.78800803e-02,  2.69940048e-02,
       -6.48146681e-03,  1.96358077e-02,  1.82543918e-02, -3.68477590e-02,
        2.41856696e-03, -4.95340675e-03, -3.48478295e-02,  1.08271334e-02,
       -3.21022533e-02, -5.36036119e-03,  2.75460654e-03, -1.27352467e-02,
       -1.13706877e-02,  2.35282518e-02, -2.14239303e-02,  3.08816712e-02,
       -1.03276344e-02,  2.90434733e-02,  1.62599888e-02,  2.45372811e-03,
        5.51254209e-03,  2.01479122e-02,  3.66191342e-02, -1.11944349e-02,
        1.51381725e-02, -4.84679500e-03,  1.28551582e-02, -2.31369771e-02,
       -5.65650291e-04, -1.10118045e-02,  1.80574618e-02,  3.62771540e-03,
       -2.21888609e-02, -6.87308982e-03,  2.82925442e-02, -4.35583573e-03,
        9.13278013e-03, -3.20234895e-02, -4.91698412e-03, -4.29586731e-02,
        1.10039003e-02, -1.23612294e-02, -2.42342893e-02, -2.12006215e-02,
       -6.56391457e-02, -4.80015716e-03, -3.89348157e-02,  3.10626123e-02,
       -2.97629498e-02,  1.48275569e-02, -2.66633537e-02,  8.03990941e-03,
       -8.21889006e-03, -3.08958516e-02,  2.18721200e-03,  1.88295245e-02,
        1.10745337e-03,  1.36450892e-02, -1.61915906e-02,  4.52060923e-02,
       -1.28785772e-02, -3.26397568e-02,  8.83214921e-03,  1.53024532e-02,
        2.25303005e-02, -3.52506787e-02,  1.30776968e-02, -8.52791406e-03,
       -3.16912606e-02,  1.57824475e-02, -3.93742770e-02, -3.08538582e-02,
       -2.79241670e-02, -1.57203674e-02,  4.89843376e-02,  4.55117039e-02,
       -1.04074031e-02, -4.56510708e-02, -6.99695433e-04,  3.32184434e-02,
        2.88528241e-02,  5.79307489e-02, -4.04030755e-02,  2.88597979e-02,
       -1.99714564e-02, -2.10167132e-02, -1.06338980e-02, -6.34980341e-03,
       -3.55270803e-02,  2.99723838e-02, -3.26331817e-02, -2.86649447e-02,
        2.49218512e-02,  2.01651938e-02, -1.74080078e-02, -2.08969600e-02,
       -1.95098929e-02, -3.78785911e-03,  6.09853491e-03,  3.31749916e-02,
        7.32298475e-03, -7.80872907e-03, -2.95911822e-02, -3.10155004e-02,
       -8.01597536e-03, -4.88945134e-02, -5.10392338e-02, -2.16337550e-03,
       -2.17909794e-02,  1.62995588e-02,  4.60712845e-03, -3.13167647e-02,
        2.47855056e-02,  1.75802130e-02,  1.22264931e-02, -2.33740024e-02,
        2.87472014e-03,  3.19335572e-02, -3.24058048e-02,  6.96288794e-03,
        3.17435935e-02,  4.48287167e-02,  2.63364408e-02,  4.23099771e-02,
        1.11029763e-02, -9.32704750e-03,  1.51349220e-03, -3.18045786e-04,
        1.40542234e-03,  3.15932035e-02,  3.65576856e-02, -3.62058431e-02,
        2.79274210e-02,  2.42222305e-02,  2.50302721e-02, -2.21638251e-02,
       -9.54793021e-03,  1.53568219e-02,  3.39120477e-02, -2.74510831e-02,
       -9.29984450e-03, -1.65520550e-03,  4.40436229e-03, -3.71786244e-02,
       -3.33332643e-02,  3.86748314e-02, -2.17604749e-02, -2.36149784e-02,
        5.15093654e-02,  2.14556325e-02,  1.06635699e-02,  4.25588675e-02,
       -4.41883504e-03, -2.02104449e-02,  1.45515120e-02, -4.27419133e-02,
       -4.21271380e-03, -1.94229931e-02,  1.48407947e-02,  3.12845893e-02,
        2.67423876e-03,  1.07703963e-02,  3.39947827e-02, -1.70744099e-02,
       -2.36273613e-02, -4.43037637e-02, -1.63983610e-02, -5.41785471e-02,
        1.83074288e-02,  2.54862681e-02,  9.20348987e-03,  4.10892516e-02,
        5.07042278e-03, -2.70914603e-02, -1.38518084e-02,  3.24477628e-02,
        1.07932640e-02,  3.76374349e-02,  1.52711980e-02,  1.73360482e-02,
       -3.07316799e-02, -1.29774418e-02,  2.48538032e-02,  4.65937611e-03,
       -9.84439068e-03,  3.09006125e-03,  2.35872176e-02,  2.23415419e-02,
       -4.85892035e-03, -1.35980686e-02,  4.15095501e-03,  2.21177936e-02,
       -1.82579970e-03, -7.40550365e-03,  2.95886025e-03,  4.30274848e-03,
       -5.91086596e-03, -4.00583856e-02, -5.42852953e-02, -5.13986684e-02,
        3.74081135e-02, -2.28457525e-02,  1.16154039e-02,  2.13403646e-02,
       -2.03589220e-02,  2.30937339e-02,  2.79324390e-02, -3.54998186e-03,
        1.46572094e-03,  4.36445586e-02,  1.24352332e-02, -2.12177895e-02,
       -3.39310579e-02, -3.96741666e-02,  2.59293262e-02, -3.73993404e-02,
       -1.47851985e-02, -1.92358512e-02, -2.56474391e-02,  5.18904580e-03,
       -1.57893039e-02, -4.75941226e-02,  1.07831787e-02,  4.99542383e-03,
       -2.84802504e-02,  1.40484190e-02,  1.04925865e-02,  3.55841666e-02,
        3.51456776e-02, -2.03344356e-02,  3.77101190e-02, -3.36607522e-03,
       -1.87401799e-03, -2.23573390e-02, -2.50486322e-02, -3.21045704e-02,
        9.73043311e-03,  2.29318980e-02, -3.15343402e-02, -2.66293436e-02,
        3.74097843e-03,  1.24811335e-02,  9.83510632e-03,  3.79327103e-03,
        3.41255143e-02,  6.54870495e-02,  1.22789629e-02,  1.21804355e-02,
       -2.07898412e-02, -9.64268446e-02, -7.24893361e-02, -1.06541626e-01,
        5.87978633e-03,  3.45353596e-02,  8.27349350e-03,  1.86664090e-02,
        3.35162468e-02, -5.17364368e-02, -4.18104939e-02,  4.29946259e-02,
        1.32521158e-02, -2.09470484e-02, -4.80837002e-02, -2.49622008e-05,
        1.26313530e-02, -2.57897470e-03, -1.96750574e-02, -1.02548767e-02,
       -8.61265603e-03, -2.32503638e-02, -1.55856283e-02, -2.62930673e-02,
       -2.48766206e-02, -3.67507488e-02,  9.02026426e-03, -3.26398872e-02,
        4.02872376e-02,  3.58586200e-02,  3.07781007e-02, -3.14716734e-02,
       -3.13915167e-04,  3.51064131e-02,  8.48770980e-03, -1.27759958e-02,
        2.76568364e-02,  3.28284316e-02,  3.08939982e-02,  5.40821394e-03,
        4.48198896e-03,  3.64931077e-02,  1.11837238e-02,  7.71355443e-03,
       -3.25965062e-02,  1.96646061e-02, -1.47183314e-02, -1.49211437e-02,
        3.97883095e-02, -3.89573015e-02, -3.81780267e-02, -1.39566753e-02,
        9.94478725e-03, -3.02257966e-02,  5.78622892e-03,  5.06301830e-03,
       -1.84271764e-02,  2.13074172e-03,  9.40147415e-03, -3.65086272e-02,
        1.42849563e-02, -6.53193425e-03, -3.13413404e-02, -5.92307886e-03,
        1.18702240e-02, -7.53889373e-03, -2.58783693e-04,  4.10295837e-02,
        2.33320035e-02, -1.84064172e-02, -2.57837512e-02, -3.79274935e-02,
       -3.50207388e-02,  4.44816612e-02, -8.64546746e-03, -3.11730336e-03,
       -3.72079387e-02, -2.36627515e-02, -3.61657888e-02, -7.35523785e-03,
        1.40801268e-02, -7.13717984e-03,  3.51759270e-02, -1.97917055e-02,
        5.50737884e-03, -4.09866050e-02, -3.84107139e-03, -8.21660832e-03,
       -9.12876986e-03,  2.34811585e-02, -2.89160497e-02, -1.53142586e-02,
       -3.00065242e-02,  3.51656787e-02,  1.02121700e-02, -1.15107046e-02,
        8.83416552e-03, -1.86832412e-03, -2.18326598e-02,  1.92975122e-02,
       -4.24314104e-02, -2.44650114e-02,  2.60957461e-02, -3.86404968e-03,
       -4.00666241e-03, -4.64800233e-03, -4.77409828e-03, -1.77312344e-02,
        4.37289141e-02,  2.34688111e-02,  6.79587154e-03,  3.00433650e-03,
        9.54599306e-03,  8.28053150e-03, -3.76618281e-02, -6.79652439e-03,
        7.15814438e-03, -1.49663743e-02, -1.89968590e-02, -2.19346210e-02,
        1.74471419e-02,  6.36349106e-03,  7.06271874e-03,  2.11578086e-02,
       -3.08901891e-02, -2.38877498e-02,  2.41755396e-02, -3.51185165e-02,
       -1.50811085e-02,  1.68147273e-02, -1.12421401e-02, -4.74481359e-02,
       -1.45359356e-02,  6.31611468e-03, -8.25325586e-03, -3.75400926e-03,
        4.29743342e-02,  2.74516759e-03, -7.20827514e-03,  9.49098263e-03,
       -2.58037243e-02, -3.85634322e-03, -9.09765344e-03, -5.41035412e-03,
       -6.26758905e-03,  3.69546898e-02,  1.09431315e-02, -1.74228419e-02,
       -3.11717149e-02, -7.65743013e-03,  1.56916324e-02,  2.46496201e-02,
       -3.07960548e-02,  1.62858274e-02, -3.59551273e-02,  7.60557642e-03,
       -3.89105082e-02, -6.27827495e-02, -7.34306276e-02, -4.10747826e-02,
        3.69259249e-03,  1.15233497e-03,  3.38431001e-02,  6.62399828e-03,
       -2.53935661e-02,  4.11079358e-03,  2.86514871e-02,  3.67520447e-03,
        2.37524579e-03,  6.05267100e-02,  2.56858650e-03, -2.85033397e-02,
       -2.69783754e-02, -2.09252164e-02,  3.64275835e-02, -1.21960063e-02,
        1.86657552e-02, -5.37237339e-02, -6.99897856e-02, -4.56988998e-02,
        3.95000353e-03,  2.50208843e-02,  1.65565475e-03,  1.87787507e-02,
        3.49667519e-02, -5.19522354e-02,  2.57036760e-02,  3.22573632e-02,
       -6.70903455e-03, -2.20629992e-03,  3.71119715e-02,  3.89192030e-02,
        6.88027777e-03,  3.18445265e-02,  4.03724611e-02,  3.68203968e-02,
        1.12879295e-02, -2.00174935e-02, -2.50400919e-02,  3.14498246e-02,
        3.96668762e-02, -3.84297557e-02,  6.57262281e-03, -3.01009659e-02,
        1.49095934e-02, -7.33917998e-03,  1.59720369e-02,  3.55817756e-04,
       -1.17538380e-03,  5.98561438e-03, -4.73745307e-03, -1.92589331e-02,
        3.39700021e-02,  8.58126767e-03, -3.10389102e-02,  2.81823911e-02,
        2.17343476e-02,  2.80485544e-02, -1.10567184e-02,  2.74093803e-02,
        4.30380628e-02,  3.64275910e-02,  7.20096100e-03,  3.27301621e-02,
       -1.35201002e-02,  3.39815505e-02,  1.55796045e-02,  4.28844392e-02,
       -1.65226422e-02, -2.94236257e-03, -2.59440094e-02,  2.13439893e-02,
        3.38713042e-02,  2.99118366e-02,  3.55073833e-03, -2.95937387e-03,
        1.03924507e-02,  2.75284890e-03, -3.00321449e-02, -2.61064433e-02,
        1.86310410e-02,  2.84124836e-02, -1.26998127e-02,  1.11494996e-02,
        2.54294090e-03, -2.64907861e-03, -2.52759494e-02, -1.44351518e-03,
       -3.34855244e-02, -2.94363722e-02,  8.07653647e-03, -3.00290473e-02,
       -8.61602928e-03, -5.79559654e-02, -7.10053369e-03,  8.14966951e-03,
       -8.68986920e-03,  5.33389784e-02,  3.08649172e-03,  5.90925924e-02,
       -3.66588384e-02, -5.60330786e-02, -4.78186496e-02, -9.97658167e-03,
       -4.51563485e-02,  1.90489506e-03, -3.35179828e-02, -4.21929844e-02,
       -1.12986220e-02, -1.30149731e-02,  2.28374056e-03, -4.66275215e-02,
        2.63731889e-02,  1.85257215e-02, -2.60131825e-02,  4.98907939e-02,
        1.58598535e-02,  1.82080697e-02,  1.40592009e-02, -3.10811102e-02,
       -1.25515740e-02, -3.23268422e-03,  1.92810316e-02, -2.09163651e-02,
       -5.44808730e-02, -3.92394699e-02,  1.48128560e-02, -1.32258357e-02,
        3.26685570e-02,  4.58192229e-02,  3.44979763e-02,  3.68499123e-02,
       -3.58392484e-02, -1.03849946e-02, -3.25050317e-02,  2.24024579e-02,
       -3.63349430e-02,  4.86830696e-02, -1.87850115e-03, -2.12333966e-02,
       -2.64946595e-02, -3.84740569e-02, -9.42239165e-03,  2.76371017e-02,
        1.86242517e-02,  2.17529424e-02,  3.21536586e-02, -5.89166721e-03,
       -8.09767749e-03, -2.15442516e-02, -1.44669851e-02, -3.84498015e-02,
       -2.94274427e-02,  4.41589206e-02, -3.88191156e-02, -4.08185497e-02,
        4.48142039e-03,  3.58350836e-02, -2.56728306e-02,  4.00693379e-02,
        3.41995656e-02,  2.75427513e-02,  2.37546135e-02, -1.27290990e-02,
       -1.67534333e-02, -2.29804702e-02,  1.54111572e-02, -2.00459976e-02,
        2.40418948e-02,  9.40226391e-03,  2.48041078e-02, -3.41293253e-02,
       -1.70451943e-02, -2.36645993e-02,  9.51265637e-03,  2.03345213e-02,
       -9.99624003e-03, -2.94560287e-02, -3.26540135e-02, -1.89685058e-02,
        1.78204812e-02, -1.95284039e-02,  3.38162556e-02, -2.26880182e-02,
       -7.95408990e-03, -1.81006007e-02,  2.75456421e-02, -2.36564167e-02,
       -5.39663099e-02, -3.21239904e-02,  2.82853860e-02, -2.73361485e-02,
        2.64239293e-02, -6.47618249e-03, -3.28217633e-02,  5.00893556e-02,
        1.97753888e-02, -1.25050312e-02, -4.32534702e-02,  3.42857861e-03,
        2.57573817e-02,  1.48535818e-02,  5.45633864e-03, -6.08773390e-03,
        6.60851970e-03, -4.18812074e-02, -6.95503550e-03,  1.87647343e-02,
        2.51435004e-02,  4.07679565e-02, -3.52257341e-02,  1.30091805e-03,
       -3.61123607e-02,  2.78266352e-02, -1.68734007e-02,  3.50679420e-02,
        1.58803221e-02, -3.05164568e-02,  1.68525428e-03, -2.15517730e-03,
       -5.94806438e-03,  4.57230397e-02,  4.04184908e-02,  2.74704229e-02,
       -1.16600720e-02,  1.00693638e-02,  1.01883486e-02,  2.04725619e-02,
        1.08724216e-03,  1.09469648e-02,  1.91716924e-02,  6.91767875e-03,
        8.28889292e-03, -2.69565452e-02,  2.65268236e-02, -2.29065772e-02,
       -5.35803959e-02, -1.05545195e-02, -6.27965899e-03, -5.03326803e-02,
       -1.49535784e-03,  1.73017941e-02,  4.12790552e-02,  2.11857893e-02,
        2.81677023e-02, -3.49020548e-02,  1.19816363e-02, -4.35651802e-02,
       -1.13208201e-02, -3.43992608e-04, -4.65367101e-02, -2.67158058e-02,
        1.90511998e-02, -3.59586999e-02, -6.03455901e-02, -2.72403397e-02,
       -2.85355374e-02, -2.15365663e-02, -1.53167993e-02, -2.59021241e-02,
       -5.00622811e-03, -6.81231497e-04, -4.71477360e-02,  2.75190752e-02,
       -2.14331709e-02,  4.41207178e-03, -3.46101522e-02, -2.74560531e-04,
        3.52519471e-03,  2.14177128e-02,  7.39114871e-03,  1.96135864e-02,
       -2.47274116e-02, -2.84725428e-03, -3.39449160e-02,  3.10385097e-02,
        3.64418491e-03, -9.50139761e-03, -3.33058871e-02, -2.91104801e-02,
        2.09152885e-03,  1.31130591e-02, -2.41233595e-02, -1.34002406e-03,
        8.73422902e-03, -2.65434547e-03,  1.72941834e-02, -3.00304871e-02,
        3.40577215e-02,  1.48235150e-02,  1.61272381e-03, -4.22340725e-03,
       -2.95127113e-03,  3.84276174e-02,  3.57077569e-02,  1.26802269e-03,
        2.16750558e-02,  1.60435271e-02, -1.25008952e-02,  1.61807090e-02,
        3.24421842e-03,  1.63156129e-02, -2.58152690e-02,  2.32346058e-02,
       -1.46768549e-02,  4.13252153e-02, -3.87819260e-02, -1.18034054e-02,
       -2.65411139e-02,  4.70749615e-03, -8.86977185e-03, -3.37992497e-02,
       -1.32262772e-02, -3.01290397e-02, -4.12626453e-02, -9.46104620e-03,
        2.65698344e-03, -3.06128841e-02, -1.45398881e-02, -1.06836082e-02,
       -2.81900205e-02,  8.46748706e-03,  4.45315987e-02,  2.55717225e-02,
        2.15572584e-02, -4.47557792e-02, -3.80929895e-02, -4.75866534e-03,
       -1.15120411e-02,  3.76312733e-02, -7.65137235e-03, -3.31715830e-02,
        1.03733242e-01,  8.88166726e-02,  3.10662016e-02,  9.58273113e-02,
        2.75014457e-03, -6.32492900e-02, -7.34091848e-02, -1.02495074e-01,
       -1.41805559e-02,  2.46159658e-02, -3.68765220e-02, -1.59341805e-02,
        9.13180336e-02, -7.94239715e-02,  1.90700721e-02,  2.10588351e-02,
       -1.72519479e-02,  3.70373502e-02,  2.91253757e-02, -2.49130111e-02,
       -2.75292713e-02, -9.07513429e-04, -2.36697365e-02, -1.92624684e-02,
        1.27826883e-02, -1.81244873e-02, -1.35303000e-02, -1.86238550e-02,
        3.26984227e-02, -1.00834109e-02, -3.39025855e-02, -6.13363460e-03,
        2.57453881e-02,  8.18416104e-02,  3.69142890e-02,  7.77312368e-02,
       -2.79799942e-02,  9.71946120e-03, -4.55801412e-02, -7.41856452e-03,
        1.89911276e-02,  3.55025940e-02,  1.78879127e-02, -3.38720232e-02,
        4.97483946e-02, -2.67886072e-02,  5.24671935e-02,  4.10754532e-02,
       -2.45858990e-02, -3.97139341e-02,  9.21308063e-03,  2.68516224e-03,
       -1.61636882e-02,  1.21650742e-02,  3.43993381e-02,  2.19116826e-02,
       -3.88426147e-02, -3.13258693e-02,  7.37233693e-03,  2.03105900e-03,
       -3.73898596e-02, -1.82121098e-02,  1.77203603e-02,  3.20723206e-02,
        1.57943126e-02, -2.93896738e-02,  6.24548923e-03, -1.13930264e-02,
        3.01000252e-02, -5.78117091e-03, -1.98329110e-02, -2.72213724e-02,
       -4.28280570e-02, -3.17101888e-02,  1.42189777e-02, -4.17840108e-02,
       -2.83146184e-02,  1.50895780e-02,  2.43866052e-02,  2.00376138e-02,
        2.39484068e-02,  5.21962382e-02,  6.97159581e-03,  7.51552591e-03,
        3.92191522e-02, -2.32788268e-03, -2.30394341e-02,  2.43414403e-03,
       -2.42985617e-02,  3.20916511e-02, -1.61868054e-02, -1.75307263e-02,
        4.58146892e-02, -5.52816177e-03, -4.00400236e-02,  5.03136963e-02,
        1.32897906e-02,  2.03858390e-02, -5.58410063e-02, -4.06601839e-02,
       -1.96752474e-02, -2.40473021e-02,  3.81379062e-03,  8.78581777e-03,
       -4.17091884e-02,  1.05977552e-02,  2.62235720e-02,  1.44347863e-03,
       -2.52359584e-02,  2.09473670e-02,  2.42765527e-02,  4.51241620e-03,
        3.74768265e-02, -1.01910718e-02, -2.17631627e-02,  1.13897705e-02,
       -1.62472315e-02, -4.75817956e-02, -7.66817015e-03, -4.60908636e-02,
       -3.45913810e-03,  9.83964186e-03,  3.31881084e-02,  3.77438357e-03,
        2.61192452e-02, -4.97299172e-02, -2.81229094e-02,  3.59535515e-02,
        5.60799055e-02,  5.49955890e-02,  2.31008921e-02,  5.47981337e-02,
        2.50816233e-02,  2.04989389e-02,  5.84693300e-03,  4.67577716e-03,
        2.38543679e-03, -1.52841248e-02, -2.06735432e-02, -4.44935709e-02,
       -5.58260689e-03, -1.98885668e-02,  3.37253995e-02,  5.03055975e-02,
        4.63922732e-02,  3.67227420e-02,  4.59108315e-02,  1.46661932e-02,
       -3.49452235e-02, -4.28547524e-02, -6.27917722e-02, -3.35717015e-02,
        3.15204699e-04, -7.92661868e-03,  1.28663760e-02,  3.22057009e-02,
        4.09287885e-02, -5.64942695e-02,  1.61284208e-02,  1.70751810e-02,
        3.17841172e-02,  3.70643325e-02,  1.18914265e-02, -2.91066617e-02,
        9.10799578e-03, -4.53930423e-02,  2.53033955e-02, -2.99437996e-02,
       -8.91616475e-03,  5.02048247e-02,  4.03619409e-02, -1.00904722e-02,
        4.42882627e-03, -1.11799249e-02,  1.70196109e-02,  8.07025842e-03,
       -5.88936508e-02, -3.39051485e-02, -1.47072074e-03, -7.76264295e-02,
        2.49368441e-03, -3.50359897e-03,  2.74971984e-02,  6.14918992e-02,
        1.13889063e-02, -4.76744771e-02, -3.16395238e-02, -2.67882757e-02,
        1.09049920e-02,  6.02437705e-02,  9.79022030e-03,  3.42560257e-03,
       -1.80479344e-02,  8.61040223e-03, -4.91671227e-02,  2.23351140e-02,
       -2.79035494e-02,  2.78732795e-02, -5.50328754e-03,  2.36920398e-02,
       -2.05818228e-02, -7.91343674e-03,  2.57068686e-03, -1.55739160e-02,
       -6.92580128e-03,  4.43214774e-02, -2.22138725e-02, -3.96634340e-02,
        3.65851782e-02,  1.23170102e-02,  4.48693857e-02, -3.39317620e-02,
        2.32625902e-02, -2.76784636e-02, -1.51364168e-03, -1.70654077e-02,
        2.51283087e-02,  3.50793749e-02,  1.56635270e-02,  4.63681761e-03,
        1.73273496e-02, -4.19323295e-02,  5.80701686e-04, -4.44956776e-03,
        6.08235504e-03,  6.04575947e-02,  6.91634417e-02,  2.08251532e-02,
       -2.36443873e-03, -5.96330725e-02, -3.59137077e-03,  8.84075277e-03,
       -1.54953515e-02,  3.34755555e-02, -1.31008290e-02, -6.10616878e-02,
        5.34969149e-03, -4.25808020e-02, -6.30491693e-03,  8.29684734e-02,
        4.84462976e-02,  1.63159538e-02,  1.89042371e-02, -2.98373047e-02,
       -3.76118347e-02,  2.54355953e-03,  3.11897323e-02, -6.90963864e-03,
        1.78041141e-02,  2.60209534e-02, -3.44392867e-03,  1.04834326e-03,
        7.12688034e-03, -2.82425666e-04,  3.26317153e-04,  2.64097210e-02,
       -3.94238718e-02,  8.04639142e-03,  1.33109428e-02,  1.04023553e-02,
       -1.39512056e-02,  4.03357111e-02,  1.17129842e-02, -2.69704554e-02,
        3.14896256e-02, -4.31000516e-02, -2.95056496e-02, -2.03518569e-02,
        2.98382547e-02,  1.34024369e-02, -1.72108207e-02,  3.06493714e-02,
       -1.83411688e-02,  5.33981295e-03, -1.84782371e-02,  3.08509972e-02,
        1.74061842e-02, -2.92257573e-02,  2.11572759e-02,  2.36452296e-02,
       -2.15997100e-02, -2.59193629e-02, -2.90675159e-03, -5.26767084e-03,
        1.43260891e-02,  1.20365713e-02,  5.53086028e-03,  1.92654058e-02,
       -4.16262560e-02,  3.33474092e-02, -1.65833253e-02,  4.70947241e-03,
       -5.88922948e-03, -1.47653103e-03, -5.32457232e-02,  1.22817038e-02,
       -1.04765212e-02, -1.78041402e-03, -1.88793056e-02,  2.86518410e-02,
        2.90409867e-02, -2.53787916e-02,  3.78740132e-02, -1.64666940e-02,
        2.13343091e-02, -1.21981474e-02, -9.64574516e-03,  2.79141758e-02,
       -2.95847817e-03,  2.02737823e-02, -3.76044624e-02, -2.54671518e-02,
       -3.07616293e-02, -3.46278176e-02,  1.05440225e-02,  2.07787752e-02,
       -2.63442304e-02, -5.31364903e-02,  9.41720605e-03,  4.77771368e-03,
        8.97041149e-03, -5.50548285e-02, -4.85216938e-02,  2.05919314e-02,
        2.69094482e-02,  2.02823207e-02,  4.98186797e-02, -3.94924870e-03,
       -1.82280224e-03, -1.49038248e-02,  2.53281258e-02, -1.68958493e-02,
       -1.60100113e-03, -2.89346408e-02,  1.88577659e-02,  1.74269720e-04,
        1.02010956e-02,  2.07758080e-02, -6.19777851e-02,  1.99850574e-02,
        6.47460623e-03, -3.53925005e-02, -7.68450380e-04,  2.24442091e-02,
       -3.74056981e-04,  1.43483588e-02, -6.61072554e-03,  6.02275413e-03,
       -6.85136300e-04, -2.98344959e-02, -1.71908401e-02, -3.86054218e-02,
        8.62146728e-04,  4.02997658e-02,  2.79025938e-02,  1.60926338e-02,
        2.79173162e-02, -1.16666844e-04,  1.37060019e-03,  5.08001782e-02,
       -1.83553100e-02, -3.07225399e-02,  2.13033818e-02,  3.78712267e-02,
        3.87047306e-02, -9.59647819e-03,  2.44034491e-02, -3.99955958e-02,
       -2.62656510e-02, -1.47507861e-02,  1.53318048e-02,  4.12745886e-02,
       -3.86294909e-02,  6.58727135e-04,  3.38083785e-03, -2.99967872e-03,
        7.36401416e-03,  3.05956043e-02,  2.87254415e-02,  1.53532075e-02,
        3.43511403e-02, -3.53532061e-02, -1.47106163e-02,  2.87212897e-02,
       -5.81063377e-03, -1.47858523e-02, -5.30588033e-04,  3.97239625e-03,
       -2.51938924e-02, -2.01773383e-02, -5.22728860e-02,  1.88153293e-02,
        2.66108476e-02, -1.27145927e-02, -9.36934445e-03, -4.10322100e-02,
        2.04976872e-02, -2.12538969e-02, -2.44326945e-02, -1.85800949e-03,
       -3.31861712e-02, -3.38412412e-02, -3.69175873e-03, -2.25524791e-02,
       -3.95313427e-02, -1.82245427e-03, -1.48965474e-02,  1.25031371e-03,
       -1.95243098e-02, -1.62132271e-02, -7.83483629e-05, -9.85070714e-04,
       -9.03231371e-03, -2.04666015e-02, -2.77793314e-02, -3.84651273e-02,
       -1.96465943e-02,  2.65442375e-02, -5.83020784e-03, -3.39202322e-02,
        2.07366124e-02,  2.54866518e-02,  4.14273294e-04, -1.32318595e-02,
       -8.62349849e-03, -2.16717236e-02, -2.83552576e-02, -1.72097404e-02,
        4.11181338e-02,  2.44522057e-02,  2.56041400e-02,  6.44153310e-03,
       -3.54326400e-03,  4.19833362e-02,  4.62046899e-02,  1.19942091e-02,
       -3.99129763e-02,  2.60301237e-03, -3.74147184e-02, -3.44359279e-02,
        1.76218580e-02,  1.97324660e-02, -3.33284251e-02, -1.42198000e-02,
        2.04942543e-02, -4.08728346e-02,  2.50435360e-02, -1.36531089e-02,
       -4.76009445e-03, -2.14758404e-02,  2.21000556e-02, -2.70859199e-03,
        3.78095731e-02,  1.74447987e-02, -1.35960728e-02, -2.75707319e-02,
        1.67809650e-02,  2.87405923e-02, -2.99060736e-02,  1.79270618e-02,
        1.63305216e-02,  1.38273137e-02,  1.58928614e-02, -1.06616467e-02,
        2.48408839e-02, -2.34645307e-02, -2.60216556e-02,  3.76184285e-02,
        1.07313609e-02,  2.59496123e-02,  1.46697275e-02,  2.08483636e-02,
        1.33525478e-02, -3.56818270e-03, -3.83855477e-02,  2.93058045e-02,
       -1.60726011e-02,  3.52066010e-03, -2.06195787e-02, -9.40708071e-03,
       -2.16059666e-03, -1.09417485e-02, -4.96614203e-02,  2.94870939e-02,
       -3.91169861e-02,  3.31852287e-02,  3.39875072e-02, -1.27721252e-02,
        2.19835751e-02, -2.58926190e-02,  2.49508042e-02, -7.71975843e-03,
       -2.70099286e-02,  3.45646888e-02, -3.72954309e-02, -2.27685831e-02,
       -2.27590390e-02, -2.49868724e-02, -3.66699845e-02, -2.75813527e-02,
       -2.25647949e-02, -3.52427401e-02, -6.70901593e-03,  1.15238084e-02,
        3.59945446e-02, -1.53473094e-02, -1.32190427e-02,  6.19126810e-03,
       -1.39158815e-02,  2.33439114e-02,  3.14718671e-02,  1.94524322e-02,
        1.47428047e-02, -2.80814953e-02,  1.91149616e-03,  4.92570549e-02,
        6.52032299e-03, -3.84688899e-02, -2.18585655e-02,  2.33375398e-03,
        1.03400163e-02, -1.37711884e-02, -4.02876399e-02,  3.62620540e-02,
        3.58391069e-02,  1.05015021e-02,  2.74620261e-02, -5.39666787e-03,
        8.63541812e-02,  6.17047437e-02,  8.31974298e-02,  6.40490577e-02,
        2.60871369e-02, -4.26643267e-02, -8.20474178e-02, -5.90682663e-02,
       -3.60721163e-02,  4.07646745e-02,  3.66039481e-03, -2.62876954e-02,
        1.69893987e-02, -6.34668916e-02, -2.83494275e-02,  5.48746698e-02,
       -1.68180410e-02, -3.78607623e-02, -2.96420176e-02, -2.89573725e-02,
        3.59634832e-02, -9.53915808e-03,  4.70686741e-02,  5.39168343e-02,
       -8.19890643e-04, -8.52804072e-03, -2.27508903e-03, -8.33478756e-03,
        1.29076717e-02,  1.15232877e-02, -2.68844701e-02, -1.21427234e-02,
